In [4]:
import pandas as pd
import numpy as np

In [5]:
df_imdb_test = pd.read_csv('raw_data/imdb/test.csv')
df_imdb_test.head()

                                                text  label
0  I always wrote this series off as being a comp...      0
1  1st watched 12/7/2002 - 3 out of 10(Dir-Steve ...      0
2  This movie was so poorly written and directed ...      0
3  The most interesting thing about Miryang (Secr...      1
4  when i first read about "berlin am meer" i did...      0

In [8]:
df_imdb_test.label.value_counts()

1    2505
0    2495
Name: label, dtype: int64

In [9]:
df_imdb_test['label'] = df_imdb_test['label'].replace(0,-1) # Replacing label 0 with -1
df_imdb_test.sample(6)

                                                   text  label
1792  I love this show and my 11 year-old daughter a...      1
1205  As a total movie geek with the fortunate job o...     -1
3991  This was a fantastically funny footie film. Wh...      1
1758  The Other Boleyn Girl - not to be confused wit...     -1
2781  I really enjoyed this film. I'm not usually on...      1
502   There is somewhere in here the makings of a de...     -1

In [10]:
df_imdb_train = pd.read_csv('raw_data/imdb/train.csv')
df_imdb_train.head()

                                                text  label
0  I grew up (b. 1965) watching and loving the Th...      0
1  When I put this movie in my DVD player, and sa...      0
2  Why do people who do not know what a particula...      0
3  Even though I have great interest in Biblical ...      0
4  Im a die hard Dads Army fan and nothing will e...      1

In [11]:
df_imdb_train['label'] = df_imdb_train['label'].replace(0,-1) # Replacing label 0 with -1
df_imdb_train.sample(6)

                                                    text  label
17284  Another "must have" film. Henry Brandon is a f...      1
7713   This movie is so bad, they wouldn't buy it bac...     -1
5217   I saw this movie just recently, and I said to ...     -1
30682  Look it's Eva Longoria and Paul Rudd in a movi...      1
36182  Despite its age, this film retains its undoubt...      1
7563   Just saw it at as closing film of Austin Film ...      1

In [12]:
df_imdb_valid = pd.read_csv('raw_data/imdb/valid.csv')
df_imdb_valid.head()

                                                text  label
0  It's been about 14 years since Sharon Stone aw...      0
1  someone needed to make a car payment... this i...      0
2  The Guidelines state that a comment must conta...      0
3  This movie is a muddled mish-mash of clichés f...      0
4  Before Stan Laurel became the smaller half of ...      0

In [13]:
df_imdb_valid['label'] = df_imdb_train['label'].replace(0,-1) # Replacing label 0 with -1
df_imdb_valid.sample(6)

                                                   text  label
163   Baldwin has really stooped low to make such mo...     -1
523   I couldn't believe the comments made about the...     -1
4787  Honestly, when I saw this movie years ago I im...     -1
4001  Okay guys, we know why we watch film like "The...      1
1028  Although Cameron Grant was clearly hired to re...      1
1983  If vampire tales are your cup of blood, then t...      1

In [14]:
combined_imdb = np.vstack([df_imdb_test, df_imdb_train, df_imdb_valid])
df_combined = pd.DataFrame(combined_imdb, columns=['text', 'label'])
df_combined

                                                    text label
0      I always wrote this series off as being a comp...    -1
1      1st watched 12/7/2002 - 3 out of 10(Dir-Steve ...    -1
2      This movie was so poorly written and directed ...    -1
3      The most interesting thing about Miryang (Secr...     1
4      when i first read about "berlin am meer" i did...    -1
...                                                  ...   ...
49995  Man, I loved this movie! This really takes me ...    -1
49996  Recovery is an incredibly moving piece of work...    -1
49997  You can take the crook out of the joint, but i...    -1
49998  FUTZ is the only show preserved from the exper...    -1
49999  "The Mother" tells of a recently widowed mid-6...    -1

[50000 rows x 2 columns]

In [15]:
df_combined.duplicated().sum()

374

In [16]:
df_combined.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   text    50000 non-null  object
 1   label   50000 non-null  object
dtypes: object(2)
memory usage: 781.4+ KB

In [17]:
df_combined = df_combined.drop_duplicates()
df_combined.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 49626 entries, 0 to 49999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   text    49626 non-null  object
 1   label   49626 non-null  object
dtypes: object(2)
memory usage: 1.1+ MB

In [19]:
df_combined.label.value_counts()

-1    24826
 1    24800
Name: label, dtype: int64

In [12]:
df_combined[1:].to_csv('formatted_data/imdb_rating.csv')